app/controllers/links_controller.rb

SELECT "items".* FROM "items" WHERE "items"."permalink" = ?  [["permalink", "/r/india/comments/3p6u5s/rss_mouthpiece_defends_dadri_vedas_order_killing/"]]
SELECT "items".* FROM "items"
INSERT INTO "items" ("thumbnail", "permalink", "url", "title", "description") VALUES (?, ?, ?, ?, ?)
---
	def index
		# require 'json'
		# require 'net/http'
		# source = 'https://www.reddit.com/r/india/.json'
		# resp = Net::HTTP.get_response(URI.parse(source))
		# data = resp.body
		# @result = JSON.parse(data)
		require 'httparty'
		response = HTTParty.get('https://www.reddit.com/r/india/.json')
		@result = JSON.parse(response.body)
		@result['data']['children'].each do |child|
		    if (child['data']['link_flair_text'].downcase == "politics")
		    	item = Item.where(:permalink => child['data']['permalink'])
		    	if (item.blank?)
		    		item = Item.create(:thumbnail => child['data']['thumbnail'], :permalink => child['data']['permalink'], :url => child['data']['url'], :title => child['data']['title'], :description => child['data']['selftext'])